Revit 2026 API

# ImageExportOptionsHLRandWFViewsFileType Property

---

File type for exported HLR and wireframe views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImageFileType HLRandWFViewsFileType { get; set; }
```
```vb
Public Property HLRandWFViewsFileType As ImageFileType
	Get
	Set
```
```cpp
public:
property ImageFileType HLRandWFViewsFileType {
	ImageFileType get ();
	void set (ImageFileType value);
}
```
```fsharp
member HLRandWFViewsFileType : ImageFileType with get, set
```

#### Property Value

ImageFileType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default is JPEGMedium. This field is ignored if used to save an image to a project as a new view.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace